# config
cask_args appdir: '/Applications'
# taps
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'

# binaries
brew 'docker'
brew 'git'
brew 'node'
brew 'deno'
brew 'awscli'
brew 'curl'
brew 'postgresql'
brew 'kafka'
brew 'nvm'
brew 'ruby'
brew 'ruby-build'
brew 'rust'
brew 'altair-graphql-client'

# zsh
brew 'zsh'
brew 'zsh-syntax-highlighting'

# applications
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'iterm2'

# 'mas install'
# mas '1Password', id: 443_987_910
